7767517
64 73
Input                    input.1                      0 1 data
Clip                     clamp_68                 1 1 data 1 0=0.000000e+00 1=1.000000e+00
Split                    splitncnn_0              1 2 1 2 3
Padding                  pad_8                    1 1 2 4 0=38 1=38 2=38 3=38 4=2 5=0 6=0
Reorg                    pixelunshuffle_67        1 1 4 5 0=2 1=0
Convolution              convrelu_0               1 1 5 6 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=2
Convolution              convrelu_1               1 1 6 7 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=2
Split                    splitncnn_1              1 2 7 8 9
Convolution              convrelu_2               1 1 9 10 0=64 1=2 -23310=1,1.000000e-01 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=16384 9=2
Convolution              convrelu_3               1 1 10 11 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=2
Convolution              convrelu_4               1 1 11 12 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=2
Split                    splitncnn_2              1 2 12 13 14
Reduction                mean_69                  1 1 14 15 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_5               1 1 15 16 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Convolution              convsigmoid_21           1 1 16 17 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=4
BinaryOp                 mul_0                    2 1 13 17 18 0=2
Crop                     pad_9                    1 1 8 19 -23310=2,-4,-4 -23311=2,-2,-1 -23309=2,4,4
Deconvolution            deconvrelu_0             1 1 18 20 0=64 1=2 -23310=1,1.000000e-01 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=16384 9=2
BinaryOp                 add_1                    2 1 19 20 21 0=0
Convolution              convrelu_6               1 1 21 22 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=2
Deconvolution            deconv_51                1 1 22 23 0=64 1=4 11=4 12=1 13=2 14=3 18=0 19=0 2=1 3=2 4=3 5=1 6=65536
Split                    splitncnn_3              1 2 23 24 25
Convolution              convrelu_7               1 1 25 26 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=2
Convolution              convrelu_8               1 1 26 27 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=2
Split                    splitncnn_4              1 2 27 28 29
Convolution              convrelu_9               1 1 29 30 0=64 1=2 -23310=1,1.000000e-01 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=16384 9=2
Convolution              convrelu_10              1 1 30 31 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=2
Convolution              convrelu_11              1 1 31 32 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=2
Split                    splitncnn_5              1 2 32 33 34
Reduction                mean_70                  1 1 34 35 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_12              1 1 35 36 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Convolution              convsigmoid_22           1 1 36 37 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=4
BinaryOp                 mul_2                    2 1 33 37 38 0=2
Split                    splitncnn_6              1 2 38 39 40
Convolution              convrelu_13              1 1 40 41 0=128 1=2 -23310=1,1.000000e-01 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=65536 9=2
Convolution              convrelu_14              1 1 41 42 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912 9=2
Convolution              convrelu_15              1 1 42 43 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912 9=2
Split                    splitncnn_7              1 2 43 44 45
Reduction                mean_71                  1 1 45 46 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_16              1 1 46 47 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Convolution              convsigmoid_23           1 1 47 48 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=4
BinaryOp                 mul_3                    2 1 44 48 49 0=2
Crop                     pad_10                   1 1 39 50 -23310=2,-4,-4 -23311=2,-2,-1 -23309=2,4,4
Deconvolution            deconvrelu_1             1 1 49 51 0=128 1=2 -23310=1,1.000000e-01 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536 9=2
BinaryOp                 add_4                    2 1 50 51 52 0=0
Convolution              convrelu_17              1 1 52 53 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=2
Convolution              convrelu_18              1 1 53 54 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=2
Split                    splitncnn_8              1 2 54 55 56
Reduction                mean_72                  1 1 56 57 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_19              1 1 57 58 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Convolution              convsigmoid_24           1 1 58 59 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=4
BinaryOp                 mul_5                    2 1 55 59 60 0=2
Crop                     pad_11                   1 1 28 61 -23310=2,-16,-16 -23311=2,-2,-1 -23309=2,16,16
Deconvolution            deconvrelu_2             1 1 60 62 0=64 1=2 -23310=1,1.000000e-01 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=16384 9=2
BinaryOp                 add_6                    2 1 61 62 63 0=0
Crop                     pad_12                   1 1 24 64 -23310=2,-20,-20 -23311=2,-2,-1 -23309=2,20,20
Convolution              convrelu_20              1 1 63 65 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=2
Convolution              conv_48                  1 1 65 66 0=64 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 add_7                    2 1 66 64 67 0=0
Convolution              conv_49                  1 1 67 68 0=12 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
Crop                     pad_13                   1 1 68 69 -23310=2,-1,-1 -23311=2,-2,-1 -23309=2,1,1
Interp                   upsample_nearest_22      1 1 3 70 0=1 1=2.000000e+00 2=2.000000e+00 6=0
PixelShuffle             pixelshuffle_66          1 1 69 71 0=2 1=0
BinaryOp                 add_8                    2 1 71 70 output 0=0
